--○ 과제
--   본인이 태어나서 현재까지...
--   얼마만큼의 일, 시간, 분, 초를 살았는지... (살고있는지...)
--   조회하는 쿼리문을 구성한다.
/*
-----------------------------------------------------------------------------
현재 시각            | 태어난 시각           |   일   |  시간  |  분  |  초  |
-----------------------------------------------------------------------------
2021-03-29 14:34:27  | 1997-12-24 15:15:00  |  XXX  |   XX   |  XX  |  XX  |
-----------------------------------------------------------------------------
*/
SELECT SYSDATE "현재 시각"
    , TO_DATE('1997-12-24 15:15:00', 'YYYY-MM-DD HH24:MI:SS') "태어난 시각"
    , TRUNC( SYSDATE - TO_DATE('1997-12-24 15:15:00', 'YYYY-MM-DD HH24:MI:SS') )"일"
    , TRUNC( MOD( (SYSDATE - TO_DATE('1997-12-24 15:15:00', 'YYYY-MM-DD HH24:MI:SS')) *24, 24 ) ) "시간"
    , TRUNC( MOD( (MOD( (SYSDATE - TO_DATE('1997-12-24 15:15:00', 'YYYY-MM-DD HH24:MI:SS')) *24, 24 ))*60, 60) ) "분"
    , TRUNC( MOD( (MOD( (MOD( (SYSDATE - TO_DATE('1997-12-24 15:15:00', 'YYYY-MM-DD HH24:MI:SS')) *24, 24 ))*60, 60))*60 , 60) ) "초"
FROM DUAL;


SELECT SYSDATE "현재 시각"
     , TO_DATE('1997-12-24 15:15:00', 'YYYY-MM-DD HH24:MI:SS') "태어난 시각"  
     , TRUNC( (SYSDATE - TO_DATE('1997-12-24 15:15:00', 'YYYY-MM-DD HH24:MI:SS')) *(24*60*60)/24/60/60 ) "일"
     , TRUNC( MOD( (SYSDATE - TO_DATE('1997-12-24 15:15:00', 'YYYY-MM-DD HH24:MI:SS')) *(24*60*60)/60/60 , 24) ) "시간"
     , MOD( TRUNC( (SYSDATE - TO_DATE('1997-12-24 15:15:00', 'YYYY-MM-DD HH24:MI:SS')) *(24*60*60)/60) , 60) "분"
     , MOD ((SYSDATE - TO_DATE('1997-12-24 15:15:00', 'YYYY-MM-DD HH24:MI:SS')) *(24*60*60) ,60) "초"
FROM DUAL;    