/*===============================
■■■ 실행 흐름의 컨트롤(제어문) ■■■
- 반복문 (while문) 실습
===============================*/

// 1부터 100까지의 정수 중에서
// 짝수의 합과 홀수의 합을 따로 구분하여 계산한다.
// 그리고 그 결과값을 출력하는 프로그램을 구현한다.
// 단, 반복문은 while 반복문을 활용하며,
// 조건문은 if 조건문을 활용하여 작성할 수 있도록 한다.

// 실행 예)
// 1부터 100까지의 정수 중
// 짝수의 합 : 2550
// 홀수의 합 : 2550
// 계속하려면 아무 키나...

public class Test045
{
	public static void main(String[] args)
	{

		// 내가 한 풀이
		/*
		int n1=1, n2=2, sum1 =0, sum2 = 0;
		while (n1<=100 && n2<=100)
		{
			sum1 += n1;
			n1 +=2;

			sum2 +=n2;
			n2 +=2; 
		}

		System.out.printf("짝수의 합 : %d\n",sum2);
		System.out.printf("홀수의 합 : %d\n",sum1);
		*/


		// 함께 한 풀이
		// ○ 주요 변수 선언
		

		// ○ 연산 및 처리
		

		// ○ 결과 출력

	}
}
/*
[실행 결과]
짝수의 합 : 2550
홀수의 합 : 2500
계속하려면 아무 키나 누르십시오 . . .
*/