/*===============================
■■■ 실행 흐름의 컨트롤(제어문) ■■■
- 반복문 (while문) 실습
===============================*/

// ○ 과제
// 사용자로부터 원하는 단(구구단)을 입력받아
// 해당하는 구구단을 출력하는 프로그램을 구현한다.
// 단, 1단 ~ 9단 사이의 수를 입력받은 상황이 아니라면
// 프로그램을 종료해버릴 수 있도록 처리한다.

// 실행 예)
// 원하는 단(구구단) 입력 : 8
// 8 * 1 = 9
// 8 * 2 = 16
// ...
// 8 * 9 = 72
// 계속하려면 아무 키나...

// 원하는 단(구구단) 입력 : 11
// 1부터 9까지의 정수만 입력 가능합니다.
// 계속하려면 아무 키나...

import java.util.Scanner;

public class Test053
{
	public static void main(String[] args)
	{	
		int n ;
		int i=1;

		Scanner sc = new Scanner(System.in);

		System.out.print("원하는 단(구구단) 입력 :" );
		n = sc.nextInt();
		
		while (i<=9)		// *1 *2 ...*9까지 
		{
			if (n>9)		// 9단을 넘으면
			{
				System.out.println("1부터 9까지의 정수만 입력 가능합니다.");
				break;
			}
		
			System.out.printf("%d * %d = %d \n",n, i, (n*i));	// 구구단 출력
			i++;

		}


	}
}
/* 
원하는 단(구구단) 입력 :8
8 * 1 = 8
8 * 2 = 16
8 * 3 = 24
8 * 4 = 32
8 * 5 = 40
8 * 6 = 48
8 * 7 = 56
8 * 8 = 64
8 * 9 = 72
계속하려면 아무 키나 누르십시오 . . .

원하는 단(구구단) 입력 :11
1부터 9까지의 정수만 입력 가능합니다.
계속하려면 아무 키나 누르십시오 . . .
*/