/*===============================
■■■ 실행 흐름의 컨트롤(제어문) ■■■
- 반복문 (while문) 실습
===============================*/

// 1부터 100까지의 정수 중에
// 짝수들의 합을 계산하여 결과값을 출력하는 프로그램을 구현한다.
// 단, 조건문은 사용하지 않도록 하며,
// while 반복문을 사용하여 작성할 수 있도록 한다.

// 실행 예)
// 1부터 100까지의 정수 중 짝수의 합 : xxxx
// 계속하려면 아무 키나...


public class Test044
{
	public static void main(String[] args)
	{

		// 내가 한 풀이
		/*
		int n =1, result=0;
		
		while (n++ <= 100)		// 1+1 3+1...97+1 99+1
		{
			result += n;		// 2   4  ...98   100
			n++;				// 2+1 4+1...98+1 100+1
		}
		
		System.out.printf("1부터 100까지의 정수 중 짝수의 합 : %d\n",result);
		*/

		// 함께 한 풀이
		int n=2;		//-- 2부터 2씩 증가하게 될 변수
		int sum=0;		//-- 누적합을 담아낼 변수
		while(n<=100)	// 2<=100 → true / 4<=100 → true
		{
			sum += n;	// sum += 2 / sum += n; (6)
			n+=2;		// n을 2만큼 증가시켜라...
		}
		System.out.printf("1부터 100까지의 정수 중 짝수의 합 : %d\n",sum);

	}
}